ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
  #ifdef USING_LED
    pixels.begin();
    pixels.setBrightness(20);
    pixels.setPixelColor(0,0xff,0xff,0xff);
    pixels.show(); 
  #endif

  #ifdef BUZZER_PIN_U8
    Buzzer.initialized(BUZZER_PIN_U8, 1);
  #else
    Buzzer.initialized(1, 1);
  #endif
  Buzzer.single_beep_tone(770, 100);


  parse_version(DAP_FIRMWARE_VERSION, &g_versionMajor, &g_versionMinor, &g_versionPatch);
  ActiveSerial->println(" ");
  ActiveSerial->println(" ");
  ActiveSerial->println(" ");
  //delay(3000);
  ActiveSerial->println("This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.");
  ActiveSerial->println("Please check github repo for more detail: https://github.com/ChrGri/DIY-Sim-Racing-FFB-Pedal");
  //printout the github releasing version
  //#ifdef OTA_update
  ActiveSerial->print("Board: ");
  ActiveSerial->println(CONTROL_BOARD);
  ActiveSerial->print("Firmware Version:");
  ActiveSerial->println(DAP_FIRMWARE_VERSION);
  //#endif
  #ifdef PRINT_PARTITION_TABLE
    ActiveSerial->printf("========== Partition Table ==========\n");
    ActiveSerial->printf("| %-10s | %-4s | %-7s | %-8s | %-8s | %-5s |\n", "Name", "Type", "SubType", "Offset", "Size", "Encrypted");
    ActiveSerial->printf("--------------------------------------------------------------------------------\n");
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
    while (it != NULL) {
        const esp_partition_t *part = esp_partition_get(it);
        ActiveSerial->printf("| %-10s | 0x%02x | 0x%02x    | 0x%08x | 0x%08x | %-5s |\n",
               part->label,      
               part->type,       
               part->subtype,    
               part->address,    
               part->size,       
               part->encrypted ? "true" : "false");
        it = esp_partition_next(it);
    }
    esp_partition_iterator_release(it);
    ActiveSerial->printf("=====================================\n");
  #endif
  
	#ifdef Hardware_Pairing_button
    pinMode(PAIRING_GPIO_U8, INPUT_PULLUP);
  #endif

  #ifdef USING_LED
    pixels.setPixelColor(0,0xff,0x00,0x00);
    pixels.show(); 
  #endif


  // Load config from EEPROM, if valid, overwrite initial config
  EEPROM.begin(2048);
  global_dap_config_class.loadConfigFromEeprom();
  global_dap_config_class.getConfig(&dap_config_st_eeprom, 500);


  // check validity of data from EEPROM  
  bool structChecker = true;
  uint16_t crc;
  if (dap_config_st_eeprom.payloadHeader_st.payloadType_u8 != DAP_PAYLOAD_TYPE_CONFIG_U8)
  {
    structChecker = false;
    /*ActiveSerial->print("Payload type expected: ");
    ActiveSerial->print(DAP_PAYLOAD_TYPE_CONFIG_U8);
    ActiveSerial->print(",   Payload type received: ");
    ActiveSerial->println(dap_config_st_local.payloadHeader_st.payloadType_u8);*/
  }
  if (dap_config_st_eeprom.payloadHeader_st.version_u8 != DAP_VERSION_CONFIG_U8)
  {
    structChecker = false;
    /*ActiveSerial->print("Config version expected: ");
    ActiveSerial->print(DAP_VERSION_CONFIG_U8);
    ActiveSerial->print(",   Config version received: ");
    ActiveSerial->println(dap_config_st_local.payloadHeader_st.version_u8);*/
  }
  // checksum validation
  crc = checksumCalculator_u16((uint8_t*)(&(dap_config_st_eeprom.payloadHeader_st)), sizeof(dap_config_st_eeprom.payloadHeader_st) + sizeof(dap_config_st_eeprom.payloadPedalConfig_st));
  if (crc != dap_config_st_eeprom.payloadFooter_st.checkSum_u16)
  {
    structChecker = false;
    /*ActiveSerial->print("CRC expected: ");
    ActiveSerial->print(crc);
    ActiveSerial->print(",   CRC received: ");
    ActiveSerial->println(dap_config_st_local.payloadFooter_st.checkSum_u16);*/
  }






  // if checks are successfull, overwrite global configuration struct
  if (structChecker == true)
  {
    ActiveSerial->println("Updating pedal config from EEPROM");
    //global_dap_config_class.setConfig(dap_config_st_local);
    dap_config_st_local = dap_config_st_eeprom;
    configDataPackage_t configPackage_st;
    configPackage_st.config_st = dap_config_st_local;
    // xQueueSend(configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY);

  }
  else
  {

    ActiveSerial->println("Couldn't load config from EPROM due to mismatch: ");

    ActiveSerial->print("Payload type expected: ");
    ActiveSerial->print(DAP_PAYLOAD_TYPE_CONFIG_U8);
    ActiveSerial->print(",   Payload type received: ");
    ActiveSerial->println(dap_config_st_local.payloadHeader_st.payloadType_u8);

    ActiveSerial->print("Target version: ");
    ActiveSerial->print(DAP_VERSION_CONFIG_U8);
    ActiveSerial->print(",    Source version: ");
    ActiveSerial->println(dap_config_st_local.payloadHeader_st.version_u8);

    ActiveSerial->print("CRC expected: ");
    ActiveSerial->print(crc);
    ActiveSerial->print(",   CRC received: ");
    ActiveSerial->println(dap_config_st_local.payloadFooter_st.checkSum_u16);
    //if the config check all failed, reinitialzie _config_st
    ActiveSerial->println("initialized config");
    global_dap_config_class.initializedConfig();
    global_dap_config_class.getConfig(&dap_config_st_local, 500);
  }

  ActiveSerial->println("Config sent successfully");
  // interprete config values
  dap_calculationVariables_st.updateFromConfig(dap_config_st_local);
  //loadcell
  /*
  #ifdef USES_ADS1220
    //Uses ADS1220
    loadcell = new LoadCellAds1220();

  #else
    //Uses ADS1256
    loadcell = new LoadCellAds1256();
  #endif

  loadcell->setLoadcellRating(dap_config_st_local.payloadPedalConfig_st.loadcellRating_u8);
  loadcell->estimateBiasAndVariance();
  */


  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0,0x5f,0x5f,0x00);//yellow
      pixels.show(); 
      //delay(3000);
  #endif

  bool invMotorDir = dap_config_st_local.payloadPedalConfig_st.invertMotorDirection_u8 > 0;
  stepper = new StepperWithLimits(STEP_PIN_STEPPER_U8, DIR_PIN_STEPPER_U8, invMotorDir, dap_calculationVariables_st.stepsPerMotorRevolution_u32, dap_config_st_local.payloadPedalConfig_st.servoRatioOfInertia_u8, dap_config_st_local.payloadPedalConfig_st.endstopDetectionThreshold_u8); 

