ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
  motorRevolutionsPerSteps_fl32 = 1.0f / ( (float)dap_calculationVariables_st.stepsPerMotorRevolution_u32 );
  // ActiveSerial->printf("Steps per motor revolution: %d\n", dap_calculationVariables_st.stepsPerMotorRevolution_u32);

  #ifdef USES_ADS1220
    //Uses ADS1220
    loadcell = new LoadCellAds1220();

  #else
    //Uses ADS1256
    loadcell = new LoadCellAds1256();
  #endif

  loadcell->setLoadcellRating(dap_config_st_local.payloadPedalConfig_st.loadcellRating_u8);
  loadcell->estimateBiasAndVariance();       // automatically identify sensor noise for KF parameterization

	// find the min & max endstops
	ActiveSerial->println("Start homing");
	stepper->findMinMaxSensorless(dap_config_st_local);
  ActiveSerial->print("Min Position is "); ActiveSerial->println(stepper->getLimitMin());
  ActiveSerial->print("Max Position is "); ActiveSerial->println(stepper->getLimitMax());


  // setup Kalman filters
  // ActiveSerial->print("Given loadcell variance: ");
  // ActiveSerial->println(loadcell->getVarianceEstimate(), 5);
  kalman = new KalmanFilter1stOrder(loadcell->getVarianceEstimate());
  kalman_joystick =new KalmanFilter1stOrder(0.1f);
  kalman_2nd_order = new KalmanFilter2ndOrder(loadcell->getVarianceEstimate());


  // LED signal 
  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0, 0x80, 0x00, 0x80);//purple
      pixels.show(); 
      //delay(3000);
  #endif

  

  // equalize pedal config for both tasks
  global_dap_config_class.getConfig(&dap_config_st_local, 500);

  // send to config handling task
  xQueueSend(s_configUpdateAvailableQueue, &dap_config_st_local, portMAX_DELAY);


  // setup multi tasking
  s_semaphore_updatePedalStates = xSemaphoreCreateMutex();



  delay(10);

  // disableCore0WDT();
  // disableCore1WDT();

  ActiveSerial->println("Starting other tasks");

  // Register tasks
  addScheduledTask(pedalUpdateTask, "pedalUpdateTask", REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US_I64, TASK_PRIORITY_PEDAL_UPDATE_TASK_UBASETYPE, CORE_ID_PEDAL_UPDATE_TASK_U8, 7000);
  addScheduledTask(serialCommunicationTaskRx, "serComRx", REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US_I64, TASK_PRIORITY_SERIALCOMMUNICATION_TASK_UBASETYPE, CORE_ID_SERIAL_COMMUNICATION_TASK_U8, 6000);

  // === Replace hw_timer with esp_timer ===
  const esp_timer_create_args_t periodic_timer_args = {
    .callback = &onTimer,
    .arg = NULL,
    .name = "sched_timer"
  };

  esp_timer_handle_t periodic_timer;
  esp_timer_create(&periodic_timer_args, &periodic_timer);

  // Start periodic timer at BASE_TICK_US interval
  esp_timer_start_periodic(periodic_timer, BASE_TICK_US);


	// the serialCommunicationTaskTx does not need a dedicated timer, since it triggered by queue 
  xTaskCreatePinnedToCore(
      serialCommunicationTaskTx,      /* Task function. */
      "serComTx",    /* name of task. */
      2000,                           /* Stack size of task */
      NULL,                           /* parameter of the task */
      TASK_PRIORITY_SERIALCOMMUNICATION_TX_TASK_UBASETYPE,                              /* priority of the task (e.g., 2, slightly higher than producer) */
      &handle_serialCommunicationTx,  /* Task handle */
      CORE_ID_SERIAL_COMMUNICATION_TASK_U8); /* pin task to core */

  // the joystickOutputTask does not need a dedicated timer, since it triggered by queue 
#ifdef USB_JOYSTICK
  xTaskCreatePinnedToCore(
      joystickOutputTask,      /* Task function. */
      "joystickOutputTask",    /* name of task. */
      4000,                           /* Stack size of task */
      NULL,                           /* parameter of the task */
      TASK_PRIORITY_JOYSTICKOUTPUT_TASK_UBASETYPE,                              /* priority of the task (e.g., 2, slightly higher than producer) */
      &handle_joystickOutput,  /* Task handle */
      CORE_ID_JOYSTICK_TASK_U8); /* pin task to core */
#endif
  // the loadcell task does not need a dedicated timer, since it blocks by DRDY ready ISR
  xTaskCreatePinnedToCore(
                    loadcellReadingTask,   /* Task function. */
                    "loadcellReadingTask",     /* name of task. */
                    1500,       /* Stack size of task */
                    NULL,        /* parameter of the task */
                    TASK_PRIORITY_LOADCELL_READING_TASK_UBASETYPE,           /* priority of the task */
                    &handle_loadcellReadingTask,      /* Task handle to keep track of created task */
                    CORE_ID_LOADCELLREADING_TASK_U8);          /* pin task to core 1 */  

  // xTaskCreatePinnedToCore(
  //                   serialCommunicationTaskRx,   /* Task function. */
  //                   "serialCommunicationTaskRx",          /* name of task. */
  //                   5000,                      /* Stack size of task */
  //                   NULL,                      /* parameter of the task */
  //                   2,                         /* priority of the task */
  //                   &handle_serialCommunicationRx, /* Task handle to keep track of created task */
  //                   CORE_ID_SERIAL_COMMUNICATION_TASK); /* pin task to core */
	
  


xTaskCreatePinnedToCore(
                    profilerTask,   /* Task function. */
                    "profilerTask",     /* name of task. */
                    3000,       /* Stack size of task */
                    NULL,        /* parameter of the task */
                    TASK_PRIORITY_PROFILER_TASK_UBASETYPE,           /* priority of the task */
                    &handle_profilerTask,      /* Task handle to keep track of created task */
                    CORE_ID_PROFILER_TASK_U8);          /* pin task to core 1 */

  xTaskCreatePinnedToCore(
                    miscTask,   
                    "miscTask", 
                    2000,  
                    NULL,      
                    TASK_PRIORITY_MISC_TASK_UBASETYPE,         
                    &handle_miscTask,    
                    CORE_ID_MISC_TASK_U8);     


                    
 
  #ifdef SERIAL_PATTERN_DETECTOR

    // --- ADD: Create the serialCommunicationTask as a standalone task ---
  // Create the queue to hold incoming serial packets
  s_serial_packet_queue = xQueueCreate(10, sizeof(UartPacket_t)); // Queue can hold 10 packets


  // This prevents the "UART driver already installed" error.
  uart_driver_delete(UART_NUM_0);
  
  // --- MODIFIED: Install driver over the existing UART0 ---
  // Note: This will reconfigure the port used by the Arduino `Serial` object.
  esp_err_t err = uart_driver_install(UART_NUM_0, UART_RX_BUF_SIZE_U32 * 2, 0, 20, &s_uart_queue, 0);
  if (err != ESP_OK) {
    ActiveSerial->printf("Failed to install UART driver: %d\n", err);
    return;
  }

  // Configure UART parameters
  // SERIAL_8N1
  uart_config_t uart_config = {
      .baud_rate = BAUD_3M_U32,
      .data_bits = UART_DATA_8_BITS,
      .parity    = UART_PARITY_DISABLE,
      .stop_bits = UART_STOP_BITS_1,
      .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
      .source_clk = UART_SCLK_XTAL,
  };
  
