ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
  // Apply the UART configuration
  uart_param_config(UART_NUM_0, &uart_config);

  // --- NEW: Enable UART pattern detection ---
  #define SERIAL_PATTERN_DETECTION_TIMEOUT_IN_US 100
  uart_enable_pattern_det_baud_intr(UART_NUM_0, EOF_BYTE_1_U8, 1, SERIAL_PATTERN_DETECTION_TIMEOUT_IN_US, 0, 0);

  // Create the task that will handle UART events
  xTaskCreate(
      uart_event_task,    // Task function
      "uart_event_task",  // Name of the task
      4096,               // Stack size
      NULL,               // Task input parameter
      12,                 // Priority of the task
      NULL                // Task handle
  );

  #endif
  



  #if defined(OTA_update)  || defined(OTA_update_ESP32)
    switch(dap_config_st_local.payloadPedalConfig_st.pedalType_u8)
    {
      case 0:
        g_apHost_pc=new char[strlen("FFBPedalClutch") + 1];
        strcpy(g_apHost_pc, "FFBPedalClutch");
        //APhost="FFBPedalClutch";
        break;
      case 1:
        g_apHost_pc=new char[strlen("FFBPedalBrake") + 1];
        strcpy(g_apHost_pc, "FFBPedalBrake");
        //APhost="FFBPedalBrake";
        break;
      case 2:
        g_apHost_pc=new char[strlen("FFBPedalGas") + 1];
        strcpy(g_apHost_pc, "FFBPedalGas");
        //APhost="FFBPedalGas";
        break;
      default:
        g_apHost_pc=new char[strlen("FFBPedal") + 1];
        strcpy(g_apHost_pc, "FFBPedal");
        //APhost="FFBPedal";
        break;        
    }                    
    addScheduledTask(otaUpdateTask, "OTATask", REPETITION_INTERVAL_OTA_TASK_IN_US_I64, TASK_PRIORITY_OTA_TASK_UBASETYPE, CORE_ID_OTA_TASK_U8, 16000);
    delay(200);
  #endif
  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0,0x00,0x00,0xff);//Blue
      pixels.show(); 
      //delay(3000);
  #endif

  //print pedal role assignment
  if(dap_config_st_local.payloadPedalConfig_st.pedalType_u8!=PEDAL_ID_UNKNOWN)
  {
    ActiveSerial->print("Pedal Assignment: ");
    ActiveSerial->println(dap_config_st_local.payloadPedalConfig_st.pedalType_u8);
  }
  else
  {
    #ifdef PEDAL_HARDWARE_ASSIGNMENT
      ActiveSerial->println("Pedal Role Assignment:4, reading from CFG pins....");
    #endif
  }
  //enable software assignment reading
  #if defined(PEDAL_SOFTWARE_ASSIGNMENT) && defined(ESPNOW_Enable)
    ActiveSerial->println("Starting software assignment");
    softwareAssignmentInitialize();
    //overwrite the pedal type with device ID
    if (deviceIdStructChecker)
    {
      dap_config_st_local.payloadPedalConfig_st.pedalType_u8 = dap_assignement_reg.deviceId_u8;
    }
    else
    {
      dap_config_st_local.payloadPedalConfig_st.pedalType_u8 = PEDAL_ID_UNKNOWN;
    }
  #endif
  #ifdef PEDAL_HARDWARE_ASSIGNMENT
    pinMode(CFG1_U8, INPUT_PULLUP);
    pinMode(CFG2_U8, INPUT_PULLUP);
    delay(50); // give the pin time to settle
    ActiveSerial->println("Overriding Pedal Role Assignment from Hardware switch......");
    uint8_t CFG1_reading = digitalRead(CFG1_U8);
    uint8_t CFG2_reading = digitalRead(CFG2_U8);
    uint8_t Pedal_assignment = CFG1_reading * 2 + CFG2_reading * 1; // 00=clutch 01=brk  02=gas
    if (Pedal_assignment == PEDAL_ID_ASSIGNMENT_ERROR)
    {
      ActiveSerial->println("Pedal Type:3, assignment error, please adjust dip switch on control board to finish role assignment.");
    }
    else
    {
      if (Pedal_assignment != PEDAL_ID_UNKNOWN)
      {
        // ActiveSerial->print("Pedal Type");
        // ActiveSerial->println(Pedal_assignment);
        if (Pedal_assignment == PEDAL_ID_CLUTCH)
          ActiveSerial->println("Overriding Pedal as Clutch.");
        if (Pedal_assignment == PEDAL_ID_BRAKE)
          ActiveSerial->println("Overriding Pedal as Brake.");
        if (Pedal_assignment == PEDAL_ID_THROTTLE)
          ActiveSerial->println("Overriding Pedal as Throttle.");
        DapConfig_t tmp;
        global_dap_config_class.getConfig(&tmp, 500);
        tmp.payloadPedalConfig_st.pedalType_u8 = Pedal_assignment;
        dap_config_st_local.payloadPedalConfig_st.pedalType_u8 = Pedal_assignment;
        // global_dap_config_class.setConfig(tmp);

        configDataPackage_t configPackage_st;
        configPackage_st.config_st = tmp;
        xQueueSend(s_configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY);
        delay(1000); // delay for writting config into global
      }
      else
      {
        ActiveSerial->println("Asssignment error, defective pin connection, pelase connect USB and send a config to finish assignment");
      }
    }

  #endif

    //enable ESP-NOW
  #ifdef ESPNOW_Enable
    dap_calculationVariables_st.rudderBrakeStatus_b=false;
    ActiveSerial->println("Starting ESP now tasks");
    ESPNow_initialize();
    ActiveSerial->println("ESPNOW initialized, add task in");
    addScheduledTask(espNowCommunicationTaskTx, "ESPNOW_update_Task", REPETITION_INTERVAL_ESPNOW_TASK_IN_US_I64, TASK_PRIORITY_ESPNOW_TASK_UBASETYPE, CORE_ID_ESPNOW_TASK_U8, 10000);
    ActiveSerial->println("ESPNOW task added");
    delay(500);
  #endif

  #if defined(CONTROLLER_SPECIFIC_VIDPID) && defined(USB_JOYSTICK) && !defined(USE_CDC_INSTEAD_OF_UART)
      ActiveSerial->println("Setup Controller");
      SetupController_USB(dap_config_st_local.payloadPedalConfig_st.pedalType_u8);
      delay(500);
  #endif
  #ifdef ESPNOW_Enable
      //print out basic pedal info via espnow
      sendESPNOWLog("Pedal:%d DAP version: %d", dap_config_st_local.payloadPedalConfig_st.pedalType_u8, DAP_VERSION_CONFIG_U8);
      delay(2);
      sendESPNOWLog("Pedal:%d Control Board: %s, Firmware: %s", dap_config_st_local.payloadPedalConfig_st.pedalType_u8, CONTROL_BOARD, DAP_FIRMWARE_VERSION);
      delay(2);
      sendESPNOWLog("Pedal:%d Servo Voltage: %.0f V, Rail pitch set to %d mm.",dap_config_st_local.payloadPedalConfig_st.pedalType_u8, (float)stepper->getServosVoltage()/10.0f , dap_config_st_local.payloadPedalConfig_st.spindlePitch_mmPerRev_u8);
      delay(2);
      sendESPNOWLog("Pedal:%d Loadcell shifting: %.3f kg, Stdev: %.4f",dap_config_st_local.payloadPedalConfig_st.pedalType_u8, loadcell->getBiasEstimate(),loadcell->getStandardDeviationEstimate());
      delay(2);
      sendESPNOWLog("Pedal:%d Min pos: %d, Max pos: %d, Current pos: %d",dap_config_st_local.payloadPedalConfig_st.pedalType_u8, stepper->getLimitMin(), stepper->getLimitMax(), stepper->getCurrentPosition());
      delay(2);
      sendESPNOWLog("Pedal:%d Setup end.",dap_config_st_local.payloadPedalConfig_st.pedalType_u8);
  #endif
  ActiveSerial->println("Setup end");
  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0,0x00,0xff,0x00);//Green
      pixels.show(); 
      //delay(3000);
  #endif
  
  Buzzer.InitializedSound((int)dap_config_st_local.payloadPedalConfig_st.pedalType_u8);

