ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
          configDataPackage_t configPackage_st;
          configPackage_st.config_st = tmp;
          xQueueSend(s_configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY);

          delay(1000);  
          stepper->printAllServoParameters();
        }

        // ActiveSerial->printf("Abs ampl.: %0.3f\n", (float)dap_calculationVariables_st.absAmplitude_fl32);
        // ActiveSerial->printf("force range.: %0.3f\n", (float)dap_calculationVariables_st.forceRange_fl32);
        // ActiveSerial->printf("pos range: %0.3f\n", (float)dap_calculationVariables_st.stepperPosRange_fl32);
        
        //bitepoint trigger
        bpTriggerValue_u8 = dap_config_pedalUpdateTask_st.payloadPedalConfig_st.bpTriggerValue_u8;
        BP_trigger_min = (bpTriggerValue_u8-4);
        BP_trigger_max = (bpTriggerValue_u8+4);

      }


      // start profiler 0, overall function
      profiler_pedalUpdateTask.start(0);
      


      cycleCount_u32++;

      // get current position
      stepperPosFraction_fl32 = stepper->getCurrentPositionFraction();
      stepperPosCurrent_i32 = stepper->getCurrentPosition();

      // system identification mode
      #ifdef ALLOW_SYSTEM_IDENTIFICATION
        if (systemIdentificationMode_b == true)
        {
          measureStepResponse(stepper, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, loadcell);
          systemIdentificationMode_b = false;
        }
      #endif
    

      
      //#define RECALIBRATE_POSITION
      #ifdef RECALIBRATE_POSITION
        stepper->checkLimitsAndResetIfNecessary();
      #endif



      // start profiler 1, effects
      profiler_pedalUpdateTask.start(1);

      // bitepoint helper
      Position_check = (int32_t)(stepperPosFraction_fl32 * 100.0f);

      // compute pedal oscillation, when ABS is active
      dap_calculationVariables_st.setDefaultPos();

      // trigger and compute effects
      absOscillation.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.absPattern_u8, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.absForceOrTarvelBit_u8);
      _RPMOscillation.trigger();
      _RPMOscillation.forceOffset(&dap_calculationVariables_st);
      _BitePointOscillation.forceOffset(&dap_calculationVariables_st);
      gForceEffect_.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.gMulti_u8);
      _WSOscillation.forceOffset(&dap_calculationVariables_st);
      roadImpactEffect_.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.roadMulti_u8);
      customVibration1_.forceOffset(dap_config_pedalUpdateTask_st.payloadPedalConfig_st.cvFreq1_u8,dap_config_pedalUpdateTask_st.payloadPedalConfig_st.cvAmp1_u8,dap_calculationVariables_st.stepperPosRange_fl32);
      customVibration2_.forceOffset(dap_config_pedalUpdateTask_st.payloadPedalConfig_st.cvFreq2_u8,dap_config_pedalUpdateTask_st.payloadPedalConfig_st.cvAmp2_u8,dap_calculationVariables_st.stepperPosRange_fl32);
      customVibration3_.forceOffset(dap_config_pedalUpdateTask_st.payloadPedalConfig_st.cvFreq3_u8,dap_config_pedalUpdateTask_st.payloadPedalConfig_st.cvAmp3_u8,dap_calculationVariables_st.stepperPosRange_fl32);
      customVibration4_.forceOffset(dap_config_pedalUpdateTask_st.payloadPedalConfig_st.cvFreq4_u8,dap_config_pedalUpdateTask_st.payloadPedalConfig_st.cvAmp4_u8,dap_calculationVariables_st.stepperPosRange_fl32);     
      if(dap_config_pedalUpdateTask_st.payloadPedalConfig_st.bpTrigger_u8==1)
      {
        if(Position_check > BP_trigger_min)
        {
          if(Position_check < BP_trigger_max)
          {
            _BitePointOscillation.trigger();
          }
        }
      }
      

      if(dap_calculationVariables_st.rudderStatus_b) 
      {
        rudderGForce_.offsetCalculate(&dap_calculationVariables_st);
        dap_calculationVariables_st.updateStepperMaxPos(rudderGForce_.offsetFilter_l);
        _rudder.offsetCalculate(&dap_calculationVariables_st);
        dap_calculationVariables_st.updateStepperMinPos(_rudder.offsetFilter_i32);

      }
      if(dap_calculationVariables_st.helicopterRudderStatus_b) 
      {
        helicopterRudder_.offsetCalculate(&dap_calculationVariables_st);
        dap_calculationVariables_st.updateStepperMinPos(helicopterRudder_.offsetFilter_i32);
      }
      #ifdef ESPNow_debug_rudder
      if(dap_calculationVariables_st.rudderStatus_b || dap_calculationVariables_st.helicopterRudderStatus_b)
      {
        if(millis()-debugMessageLast>500 )
        {
          debugMessageLast=millis();
          ActiveSerial->print("Center offset:");
          ActiveSerial->println(_rudder.offsetFilter_i32);
          ActiveSerial->print("pos min:");
          ActiveSerial->println(dap_calculationVariables_st.stepperPosMin_i32);
          ActiveSerial->print("pos max:");
          ActiveSerial->println(dap_calculationVariables_st.stepperPosMax_i32);
          ActiveSerial->print("max Force:");
          ActiveSerial->print("max Force:");
          ActiveSerial->print(dap_calculationVariables_st.forceMax_fl32);
          ActiveSerial->print(" min Force:");
          ActiveSerial->println(dap_calculationVariables_st.forceMin_fl32);
          ActiveSerial->print("Force:");
          ActiveSerial->println(filteredReading);
        }
      }
      #endif

      //_rudder.forceOffsetCalculate(&dap_calculationVariables_st);


      //update max force with G force effect
      g_movingAverageFilter_st.dataPointsCount_i32 = dap_config_pedalUpdateTask_st.payloadPedalConfig_st.gWindow_u8;
      g_movingAverageFilterRoadImpact_st.dataPointsCount_i32 = dap_config_pedalUpdateTask_st.payloadPedalConfig_st.roadWindow_u8;
      dap_calculationVariables_st.resetMaxForce();
      dap_calculationVariables_st.forceMax_fl32 += gForceEffect_.gForce_fl32;
      dap_calculationVariables_st.forceMax_fl32 += roadImpactEffect_.roadImpactForce_fl32;
      dap_calculationVariables_st.dynamicUpdate();
      dap_calculationVariables_st.updateStiffness();
    
      // end profiler 1, effects
      profiler_pedalUpdateTask.end(1);

