ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
      // read loadcell data, when available
      profiler_pedalUpdateTask.start(2);
      if (xQueueReceive(s_loadcellDataQueue, &loadcellDataReceived_st, (TickType_t)0) == pdPASS) {
        loadcellReading = loadcellDataReceived_st.loadcellReadingInKg_fl32;
      }
      profiler_pedalUpdateTask.end(2);



      
  #ifdef ANGLE_SENSOR_GPIO
        angleReading_ui16 = analogRead(ANGLE_SENSOR_GPIO);
  #endif

      // Get the angle measurement reading
      // float angleReading = loadcell->getAngleMeasurement();
    

      // start profiler 3, loadcell reading conversion
      profiler_pedalUpdateTask.start(3);

      // Convert loadcell reading to pedal force
      float sledPosition = sledPositionInMM(stepper, &dap_config_pedalUpdateTask_st, motorRevolutionsPerSteps_fl32);
      float pedalInclineAngleInDeg_fl32 = pedalInclineAngleDeg(sledPosition, &dap_config_pedalUpdateTask_st);
      float pedalForce_fl32 = convertToPedalForce(loadcellReading, sledPosition, &dap_config_pedalUpdateTask_st);
      float d_phi_d_x = convertToPedalForceGain(sledPosition, &dap_config_pedalUpdateTask_st);

      // compute gain for horizontal foot model
      float b = (float)dap_config_pedalUpdateTask_st.payloadPedalConfig_st.lengthPedalB_i16;
      float d = (float)dap_config_pedalUpdateTask_st.payloadPedalConfig_st.lengthPedalD_i16;
      float d_x_hor_d_phi = -(float)(b+d) * isin(pedalInclineAngleInDeg_fl32);
      d_x_hor_d_phi *= DEG_TO_RAD_FL32; // inner derivative

      // start profiler 3, loadcell reading conversion
      profiler_pedalUpdateTask.end(3);

      // start profiler 4, loadcell reading filtering
      profiler_pedalUpdateTask.start(4);
      
      // Do the loadcell signal filtering
      float alpha_exp_filter = 1.0f - ( (float)dap_config_pedalUpdateTask_st.payloadPedalConfig_st.kfModelNoise_u8) / 5000.0f;
      // const velocity model denoising filter
      switch (dap_config_pedalUpdateTask_st.payloadPedalConfig_st.kfModelOrder_u8) {
        case 0:
          filteredReading = kalman->filteredValue(pedalForce_fl32, 0.0f, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.kfModelNoise_u8);
          changeVelocity = kalman->changeVelocity();
          break;
        case 1:
          filteredReading = kalman_2nd_order->filteredValue(pedalForce_fl32, 0.0f, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.kfModelNoise_u8);
          changeVelocity = kalman_2nd_order->changeVelocity();
          break;
        case 2:
          filteredReading_exp_filter = filteredReading_exp_filter * alpha_exp_filter + pedalForce_fl32 * (1.0f-alpha_exp_filter);
          filteredReading = filteredReading_exp_filter;
          break;
        default:
          filteredReading = pedalForce_fl32;
          break;
      }
      //write filter reading into calculation_st
      dap_calculationVariables_st.currentForceReading_fl32=filteredReading;


      // end profiler 4, loadcell reading filtering
      profiler_pedalUpdateTask.end(4);


      
      float FilterReadingJoystick=0.0f;
      if(dap_config_pedalUpdateTask_st.payloadPedalConfig_st.kfJoystick_u8==1)
      {
        FilterReadingJoystick=kalman_joystick->filteredValue(filteredReading,0.0f,dap_config_pedalUpdateTask_st.payloadPedalConfig_st.kfModelNoiseJoystick_u8);

      }
      else
      {
        FilterReadingJoystick=filteredReading;
      }


      //if filtered reading > min force, mark the servo was in aciton
      if(filteredReading > dap_config_pedalUpdateTask_st.payloadPedalConfig_st.preloadForce_fl32)
      {
        servoActionLast = millis();
      }

      // wakeup process
      if ((filteredReading > STEPPER_WAKEUP_FORCE) && (stepper->servoStatus == SERVO_IDLE_NOT_CONNECTED))
      {
        Buzzer.single_beep_tone(770, 100);
        delay(300);
        Buzzer.single_beep_tone(770, 100);
        ActiveSerial->println("Wake up servo, restart esp.");
        delay(1000);
        ESP.restart();
      }

      // pedal not in action, disable pedal power
      uint32_t pedalIdleTimout = dap_config_pedalUpdateTask_st.payloadPedalConfig_st.servoIdleTimeout_u8 * 60 * 1000; // timeout in ms
      if ((stepper->servoStatus == SERVO_CONNECTED) && ((millis() - servoActionLast) > pedalIdleTimout) && (dap_config_pedalUpdateTask_st.payloadPedalConfig_st.servoIdleTimeout_u8 != 0))
      {
        stepper->servoIdleAction();
        stepper->servoStatus = SERVO_IDLE_NOT_CONNECTED;
        Buzzer.single_beep_tone(770, 100);
        delay(300);
        #ifdef USING_LED
          pixels.setPixelColor(0, 0xff, 0x00, 0x00); // show red
          pixels.show();
        #endif
        Buzzer.single_beep_tone(770, 100);
        ActiveSerial->println("Servo idle timeout reached. To restart pedal, please apply pressure.");
      }
      //emergency button

      #ifdef EMERGENCY_PIN_U8
        if ((stepper->servoStatus == SERVO_CONNECTED) && (stepper->servoStatus != SERVO_FORCE_STOP) && (digitalRead(EMERGENCY_PIN_U8) == LOW))
        {
          stepper->servoIdleAction();
          stepper->servoStatus = SERVO_FORCE_STOP;
          Buzzer.single_beep_tone(770, 100);
          delay(300);
          #ifdef USING_LED
            pixels.setPixelColor(0, 0xff, 0x00, 0x00); // show red
            pixels.show();
          #endif
          Buzzer.single_beep_tone(770, 100);
          ActiveSerial->println("Servo force Stoped.");
        }
      #endif
      //float FilterReadingJoystick=averagefilter_joystick.process(filteredReading);


      // start profiler 4, movement strategy
      profiler_pedalUpdateTask.start(5);

      

      int32_t Position_Next = 0;

      // Adding effects
      effect_pos_fl32 = 0.0f;
      effect_force_fl32 = 0.0f;
      bool effectsCalculated_b=false;
      // only add force when not at min position 
      if(dap_config_pedalUpdateTask_st.payloadPedalConfig_st.minForceForEffects_u8!=0)
      {
        if(filteredReading >= (float)dap_config_pedalUpdateTask_st.payloadPedalConfig_st.minForceForEffects_u8)
        {
          effectsCalculated_b = true;
        }
      }
      else
      {
        // accumulate force offsets
        effectsCalculated_b=true;
        //effect_pos_fl32 += _RPMOscillation.RPM_position_offset;
      }
      if(effectsCalculated_b)
      {
        effect_force_fl32 += absOscillation.absOscillationForceOffset_fl32;
        // accumulate position offsets
        effect_pos_fl32 += absOscillation.absOscillationPositionOffset_fl32;
        effect_pos_fl32 += _WSOscillation.wheelSlipOffset_fl32;
        effect_pos_fl32 += _BitePointOscillation.bitePointOffset_fl32;
        effect_pos_fl32 += customVibration1_.customVibrationOffset_fl32;
        effect_pos_fl32 += customVibration2_.customVibrationOffset_fl32;
        effect_pos_fl32 += customVibration3_.customVibrationOffset_fl32;
        effect_pos_fl32 += customVibration4_.customVibrationOffset_fl32;
        effect_pos_fl32 += _RPMOscillation.rpmPositionOffset_i32;
      }

      // add dampening
      if (dap_calculationVariables_st.dampingPress_fl32  > 0.0001f)
      {
        // dampening is proportional to velocity --> D-gain for stability
        effect_pos_fl32 -= dap_calculationVariables_st.dampingPress_fl32 * changeVelocity * dap_calculationVariables_st.springStiffnesssInv_fl32;
      }



      // Due to closed loop frequiency response, the servo might travel less than the input amplitude. 
      // To compensate the attenuation, the input amplitude is scaled by a constant factor, which was identified for 15Hz input frequency and roughly resulted in plausible amplitude range. 
      effect_force_fl32 *= EFFECT_SCALING_FACTOR_FL32;
      effect_pos_fl32 *= EFFECT_POSITION_SCALING_FACTOR_FL32;
      


      // chatter reduction gain, reduce the gain when chatter happened
      /*
      if (chatterReduction.checkForChatter(stepperPosCurrent_i32, esp_timer_get_time(), false))
      {
        effect_pos_fl32 *= chatterReduction.DynamicEffectGain();
      }
      */

      
      // compute next position with PID strategy
      // MPC control strategy for rudder
      int32_t positionWithoutEffect=0;
      if(dap_calculationVariables_st.rudderStatus_b || dap_calculationVariables_st.helicopterRudderStatus_b)
      {
        // Rudder only
        Position_Next = MoveByForceTargetingStrategy(filteredReading, stepper, &forceCurve, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, 0.0f/*effect_force*/, changeVelocity, d_phi_d_x, d_x_hor_d_phi);
        positionWithoutEffect=Position_Next;//send the value without rpm effect
        if(effectsCalculated_b)
        {
          //float effectsOffsetFiltered= effectOffsetPID.computeEffectOffset(effect_pos_fl32, &dap_calculationVariables_st);
          //Position_Next -= effectsOffsetFiltered;
          Position_Next -= effect_pos_fl32;
        } 
        //if(effectsCalculated_b) Position_Next -= _RPMOscillation.RPM_position_offset;
      }
      else 
      {
        // Pedal control
        //Position_Next = MoveByPidStrategy(filteredReading, stepper, &forceCurve, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, effect_force_fl32, 0);
        Position_Next = MoveByAdmittanceStrategy(filteredReading, stepper, &forceCurve, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, effect_force_fl32, 0);
        
        if(effectsCalculated_b)
        {
          Position_Next -= effect_pos_fl32;
        } 
      }
      // end profiler 4, movement strategy
      profiler_pedalUpdateTask.end(5);

      // start profiler 6, ...
      profiler_pedalUpdateTask.start(6);

      
      // clip target position to configured target interval with RPM effect movement in the endstop
      Position_Next = (int32_t)constrain(Position_Next, dap_calculationVariables_st.stepperPosMinEndstop_i32, dap_calculationVariables_st.stepperPosMaxEndstop_i32);
      //Position_Next = (int32_t)constrain(Position_Next, dap_calculationVariables_st.stepperPosMin_i32, dap_calculationVariables_st.stepperPosMax_i32);

      

      // rudder helper
      Rudder_real_poisiton= 100*((positionWithoutEffect-dap_calculationVariables_st.stepperPosMinDefault_i32) / dap_calculationVariables_st.stepperPosRangeDefault_fl32);

      dap_calculationVariables_st.currentPedalPosition_u32 = positionWithoutEffect;
      dap_calculationVariables_st.currentPedalPositionRatio_fl32=((float)(dap_calculationVariables_st.currentPedalPosition_u32-dap_calculationVariables_st.stepperPosMinDefault_i32))/((float)dap_calculationVariables_st.stepperPosRangeDefault_fl32);
      //Rudder initialzing and de initializing
      #ifdef ESPNOW_Enable
        if(dap_calculationVariables_st.rudderStatus_b)
        {
          if(Rudder_initializing)
          {
            moveSlowlyToPosition_b=true;
            //ActiveSerial->println("moving to center");
          }
          if(Rudder_initializing && (Rudder_real_poisiton<52 && Rudder_real_poisiton>48))
          {
            if(Rudder_initialized_time==0)
            {
              Rudder_initialized_time=millis();
            }
            else
            {
              unsigned long Rudder_initialzing_time_Now = millis();
              //wait 3s for the initializing
              //ActiveSerial->print("Rudder initializing...");
              //ActiveSerial->println(Rudder_initialzing_time_Now-Rudder_initialized_time);
              if( (Rudder_initialzing_time_Now-Rudder_initialized_time)> Rudder_timeout )
              {
                Rudder_initializing=false;
                moveSlowlyToPosition_b=false;
                ActiveSerial->println("Rudder initialized");
                dap_calculationVariables_st.isRudderInitialized_b=true;
                Rudder_initialized_time=0;
                Buzzer.play_melody_tone(melody_Airship_theme, sizeof(melody_Airship_theme)/sizeof(melody_Airship_theme[0]),melody_Airship_theme_duration);
              }
            }
            

