ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
          }
        }
        if(Rudder_deinitializing)
        {
          moveSlowlyToPosition_b=true;
          //ActiveSerial->println("moving to min end stop");
        }
        if(Rudder_deinitializing && (Rudder_real_poisiton< 2 ))
        {
          Rudder_deinitializing=false;
          moveSlowlyToPosition_b=false;
          ActiveSerial->println("Rudder deinitialized");
          dap_calculationVariables_st.isRudderInitialized_b=false;
        }
        //helicopter rudder initialzied
        if(dap_calculationVariables_st.helicopterRudderStatus_b)
        {
          if(HeliRudder_initializing)
          {
            moveSlowlyToPosition_b=true;
            //ActiveSerial->println("moving to center");
          }
          if(HeliRudder_initializing && (Rudder_real_poisiton<52 && Rudder_real_poisiton>48))
          {
            if(Rudder_initialized_time==0)
            {
              Rudder_initialized_time=millis();
            }
            else
            {
              unsigned long Rudder_initialzing_time_Now = millis();
              //wait 3s for the initializing
              //ActiveSerial->print("Rudder initializing...");
              //ActiveSerial->println(Rudder_initialzing_time_Now-Rudder_initialized_time);
              if( (Rudder_initialzing_time_Now-Rudder_initialized_time)> Rudder_timeout )
              {
                HeliRudder_initializing=false;
                moveSlowlyToPosition_b=false;
                ActiveSerial->println("HeliRudder initialized");
                dap_calculationVariables_st.isHelicopterRudderInitialized_b=true;
                Rudder_initialized_time=0;
                Buzzer.play_melody_tone(melodyAirwolfTheme, sizeof(melodyAirwolfTheme)/sizeof(melodyAirwolfTheme[0]),melodyAirwolfThemeDuration);
              }
            }
          }
        }
        if(HeliRudder_deinitializing)
        {
          moveSlowlyToPosition_b=true;
            //ActiveSerial->println("moving to min end stop");
        }
        if(HeliRudder_deinitializing && (Rudder_real_poisiton< 2 ))
        {
          HeliRudder_deinitializing=false;
          moveSlowlyToPosition_b=false;
          ActiveSerial->println("HeliRudder deinitialized");
          dap_calculationVariables_st.isHelicopterRudderInitialized_b=false;
        }
      #endif

      

      // if pedal in min position, recalibrate position --> automatic step loss compensation
      // stepper->configSteplossRecovAndCrashDetection(dap_config_pedalUpdateTask_st.payloadPedalConfig_st.stepLossFunctionFlags_u8);
      if( (stepper->getLifelineSignal()==true) && (stepper->servoStatus==SERVO_CONNECTED) )
      {
        if (stepper->isAtMinPos())
        {
          #if defined(OTA_update_ESP32) || defined(OTA_update)
            if(g_OTA_status==false)
            {
              stepper->correctPos();
            }
          #else
            stepper->correctPos();
          #endif
        }
      }
      

      


      // stop movement, when OTA is in progres
      bool doMovement_b = true;
      #if defined(OTA_update_ESP32) || defined(OTA_update)
        if(g_OTA_status==true)
        {
          doMovement_b = false;
        } 
      #endif

      // Move to new position
      if (doMovement_b)
      {
		  

#ifdef S_CURVE_POSITION_SHAPING
        static bool s_positionGovernorInitialized_b = false;
        static float s_positionGovernorPos_fl32 = 0.0f;
        static float s_positionGovernorVel_fl32 = 0.0f;
        static float s_positionGovernorAcc_fl32 = 0.0f;

        // --- Jerk-limited position command shaping ("S-curve-ish" governor) ---
        // Purpose:
        //   Limit discontinuities in the commanded position/velocity/acceleration that would
        //   otherwise excite the (aggressive) servo inner PID and create audible/feelable jitter.
        //
        // We maintain an internal trajectory state (x_g, v_g, a_g) and drive it toward the
        // instantaneous command x_cmd (= Position_Next), subject to limits.
        //
        // Constraints:
        //   |v_g| <= v_max
        //   |a_g| <= a_max
        //   |j_g| <= j_max   where j_g := da_g/dt
        //
        // Parameterization (simple, monotonic mapping from "smoothing time" T):
        //   a_max = v_max / T
        //   j_max = a_max / T = v_max / T^2
        //
        // Discrete-time update each control tick (dt):
        //   e      = x_cmd - x_g
        //   v_des  = clamp(e/dt,  ±v_max)
        //   a_des  = clamp((v_des - v_g)/dt, ±a_max)
        //   a_g   += clamp(a_des - a_g, ±j_max*dt)
        //   v_g   += a_g * dt
        //   x_g   += v_g * dt
        //
        // Finally, we round x_g back to integer steps for the stepper command.

        bool isPedalControlStrategy_b = !(dap_calculationVariables_st.rudderStatus_b || dap_calculationVariables_st.helicopterRudderStatus_b);
        bool enablePositionGovernor_b = isPedalControlStrategy_b && (0u != dap_config_pedalUpdateTask_st.payloadPedalConfig_st.positionSmoothingFactor_u8);

        if (moveSlowlyToPosition_b)
        {
          s_positionGovernorInitialized_b = false;
        }

        if (enablePositionGovernor_b && (!moveSlowlyToPosition_b))
        {
          float deltaTime_s_fl32 = ((float)REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US_I64) * 1e-6f;
          float smoothingTime_s_fl32 = ((float)dap_config_pedalUpdateTask_st.payloadPedalConfig_st.positionSmoothingFactor_u8) * 1e-4f;

          if ((deltaTime_s_fl32 > 0.0f) && (smoothingTime_s_fl32 > 0.0f))
          {
            if (!s_positionGovernorInitialized_b)
            {
              s_positionGovernorPos_fl32 = (float)stepper->getTargetPositionSteps();
              s_positionGovernorVel_fl32 = 0.0f;
              s_positionGovernorAcc_fl32 = 0.0f;
              s_positionGovernorInitialized_b = true;
            }

            float maxSpeed_stepsPerS_fl32 = (float)stepper->getCurrentSpeedInMilliHz();
            if (maxSpeed_stepsPerS_fl32 < 1.0f)
            {
              maxSpeed_stepsPerS_fl32 = (float)MAXIMUM_STEPPER_SPEED_U32;
            }

            float maxAccel_stepsPerS2_fl32 = maxSpeed_stepsPerS_fl32 / smoothingTime_s_fl32;
            float maxJerk_stepsPerS3_fl32 = maxAccel_stepsPerS2_fl32 / smoothingTime_s_fl32;

            float targetPos_fl32 = (float)Position_Next;
            float errorSteps_fl32 = targetPos_fl32 - s_positionGovernorPos_fl32;
            float desiredVel_stepsPerS_fl32 = constrain(errorSteps_fl32 / deltaTime_s_fl32, -maxSpeed_stepsPerS_fl32, maxSpeed_stepsPerS_fl32);

            float desiredAcc_stepsPerS2_fl32 = (desiredVel_stepsPerS_fl32 - s_positionGovernorVel_fl32) / deltaTime_s_fl32;
            desiredAcc_stepsPerS2_fl32 = constrain(desiredAcc_stepsPerS2_fl32, -maxAccel_stepsPerS2_fl32, maxAccel_stepsPerS2_fl32);

            float accDelta_stepsPerS2_fl32 = desiredAcc_stepsPerS2_fl32 - s_positionGovernorAcc_fl32;
            float maxAccDelta_stepsPerS2_fl32 = maxJerk_stepsPerS3_fl32 * deltaTime_s_fl32;
            accDelta_stepsPerS2_fl32 = constrain(accDelta_stepsPerS2_fl32, -maxAccDelta_stepsPerS2_fl32, maxAccDelta_stepsPerS2_fl32);
            s_positionGovernorAcc_fl32 += accDelta_stepsPerS2_fl32;

            s_positionGovernorVel_fl32 += s_positionGovernorAcc_fl32 * deltaTime_s_fl32;
            s_positionGovernorVel_fl32 = constrain(s_positionGovernorVel_fl32, -maxSpeed_stepsPerS_fl32, maxSpeed_stepsPerS_fl32);

            s_positionGovernorPos_fl32 += s_positionGovernorVel_fl32 * deltaTime_s_fl32;

            if (((errorSteps_fl32 >= 0.0f) && (s_positionGovernorPos_fl32 > targetPos_fl32)) || ((errorSteps_fl32 <= 0.0f) && (s_positionGovernorPos_fl32 < targetPos_fl32)))
            {
              s_positionGovernorPos_fl32 = targetPos_fl32;
              s_positionGovernorVel_fl32 = 0.0f;
              s_positionGovernorAcc_fl32 = 0.0f;
            }

