ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
            Position_Next = (int32_t)floorf(s_positionGovernorPos_fl32 + 0.5f);
            Position_Next = (int32_t)constrain(Position_Next, dap_calculationVariables_st.stepperPosMinEndstop_i32, dap_calculationVariables_st.stepperPosMaxEndstop_i32);
          }
        }
        else
        {
          s_positionGovernorInitialized_b = false;
        }
#endif
		
        		
        static bool lastDirection_b = true; // Neu hinzufügen oben in der Funktion

        if (!moveSlowlyToPosition_b)
        {
          int32_t distanceToMove = Position_Next - stepperPosCurrent_i32;
          
          if (distanceToMove != 0) 
          {
            float deltaTime_s_fl32 = ((float)REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US_I64) * 1e-6f;
            float requiredSpeed = abs(distanceToMove) / deltaTime_s_fl32;
            
            // Minimal überschätzen, damit er das Ziel rechtzeitig erreicht
            requiredSpeed *= 1.1f; 

            if (requiredSpeed > (float)MAXIMUM_STEPPER_SPEED_U32) {
                requiredSpeed = (float)MAXIMUM_STEPPER_SPEED_U32;
            }

            stepper->moveToWithSpeed((int32_t)Position_Next, (uint32_t)abs(requiredSpeed));
            //stepper->moveToWithSpeed((int32_t)Position_Next, (uint32_t)abs(250000));
            //stepper->moveTo((int32_t)Position_Next);


            /*
            bool forwardDir = (distanceToMove > 0);
            
            // Wenn der Motor nicht läuft oder die Richtung wechseln muss, starte ihn neu
            if (!stepper->isRunning() || (forwardDir != lastDirection_b)) 
            {
                stepper->keepRunningInDir(forwardDir, (uint32_t)requiredSpeed);
                lastDirection_b = forwardDir;
            } 
            else 
            {
                // Läuft bereits in die richtige Richtung -> nur live den Speed anpassen (kein Stoppen!)
                stepper->setSpeedLive((uint32_t)requiredSpeed);
            }
                */
          } 
          /*else 
          {
            // Am Ziel angekommen
            if (stepper->isRunning()) {
                stepper->forceStop();
            }
          }*/
        }
        else
        {
          moveSlowlyToPosition_b = false;
          stepper->moveSlowlyToPos(Position_Next);
        }
      }
    
      // compute controller output
      dap_calculationVariables_st.stepperPosSetback();
      dap_calculationVariables_st.resetMaxForce();
      dap_calculationVariables_st.dynamicUpdate();
      dap_calculationVariables_st.updateStiffness();
      

      // compute joystick value
      if(dap_calculationVariables_st.rudderStatus_b&&dap_calculationVariables_st.rudderBrakeStatus_b)
      {
        if (1 == dap_config_pedalUpdateTask_st.payloadPedalConfig_st.travelAsJoystickOutput_u8)
        {
          joystickNormalizedToInt32_orig = NormalizeControllerOutputValue((stepperPosCurrent_i32-dap_calculationVariables_st.stepperPosRange_fl32/2), dap_calculationVariables_st.stepperPosMin_i32, dap_calculationVariables_st.stepperPosMin_i32+dap_calculationVariables_st.stepperPosRange_fl32/2.0f, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.maxGameOutput_u8);
        }
        else
        {
          joystickNormalizedToInt32_orig = NormalizeControllerOutputValue((FilterReadingJoystick/*filteredReading*/), dap_calculationVariables_st.forceMin_fl32, dap_calculationVariables_st.forceMax_fl32, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.maxGameOutput_u8);
        }
      }
      else
      {
        if (1 == dap_config_pedalUpdateTask_st.payloadPedalConfig_st.travelAsJoystickOutput_u8)
        {
          joystickNormalizedToInt32_orig = NormalizeControllerOutputValue(stepperPosCurrent_i32, dap_calculationVariables_st.stepperPosMin_i32, dap_calculationVariables_st.stepperPosMax_i32, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.maxGameOutput_u8);
        }
        else
        {            
          joystickNormalizedToInt32_orig = NormalizeControllerOutputValue(FilterReadingJoystick/*filteredReading*/, dap_calculationVariables_st.forceMin_fl32, dap_calculationVariables_st.forceMax_fl32, dap_config_pedalUpdateTask_st.payloadPedalConfig_st.maxGameOutput_u8);
        }
      }
      joystickfrac=(float)joystickNormalizedToInt32_orig/(float)s_JOYSTICK_MAX_VALUE_U16;
      joystickNormalizedToInt32_eval = forceCurve.EvalJoystickCubicSpline(&dap_config_pedalUpdateTask_st, &dap_calculationVariables_st, joystickfrac);
      
      joystickNormalizedToUInt16 = joystickNormalizedToInt32_eval/100.0f* s_JOYSTICK_MAX_VALUE_U16;
      joystickNormalizedToUInt16 = constrain(joystickNormalizedToUInt16, s_JOYSTICK_MIN_VALUE_U16, s_JOYSTICK_MAX_VALUE_U16);      


      // send joystick data to queue
      if (s_joystickDataQueue != NULL) {

        // send data every N-th frame
        sendJoystickDataCounter_u8++;
        sendJoystickDataCounter_u8 %= joystickSendCounterMax_u8;

        if (sendJoystickDataCounter_u8 == 0)
        {
          // Package the new state data into a single struct
          joystickDataPackage_t newJoystickPackage;
          newJoystickPackage.sendJoystickFlag_b = true;
          newJoystickPackage.joystickNormalizedToUInt16 = joystickNormalizedToUInt16;

          // Send the package to the queue. Use a timeout of 0 (non-blocking).
          // If the queue is full, the data is simply dropped. This prevents this
          // high-priority control task from ever blocking on a full serial buffer.
          xQueueSend(s_joystickDataQueue, &newJoystickPackage, (TickType_t)0);
        }
      }


      

      // provide joystick output on PIN
      #ifdef Using_analog_output
        int dac_value=(int)(joystickNormalizedToInt32*255/10000);
        dacWrite(DAC_OUTPUT_PIN_U8,dac_value);
      #endif

      #ifdef Using_analog_output_ESP32_S3
        if(MCP_status)
        {
          int dac_value=(int)(joystickNormalizedToInt32*4096*0.9/10000);//limit the max to 5V*0.9=4.5V to prevent the overvolatage
          dac.setVoltage(dac_value, false);
        }
      #endif

      
      
