ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.angleSensorOutput_u16 = angleReading_ui16;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalStateExtended_st.brakeResistorState_b = stepper->getBrakeResistorState();
          dap_state_extended_st_lcl_pedalUpdateTask.payloadHeader_st.pedalTag_u8 = dap_config_pedalUpdateTask_st.payloadPedalConfig_st.pedalType_u8;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadHeader_st.payloadType_u8 = DAP_PAYLOAD_TYPE_STATE_EXTENDED_U8;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadHeader_st.version_u8 = DAP_VERSION_CONFIG_U8;
        }



        if (sendPedalStructsViaSerialCounter_u8 == 0)
        {
          // Package the new state data into a single struct
          PedalStatePackage_t newStatePackage;
          newStatePackage.basic_st = dap_state_basic_st_lcl_pedalUpdateTask;
          newStatePackage.extended_st = dap_state_extended_st_lcl_pedalUpdateTask;
          newStatePackage.sendBasicFlag_b = sendBasicFlag_b;
          newStatePackage.sendExtendedFlag_b = sendExtendedFlag_b;

          // Send the package to the queue. Use a timeout of 0 (non-blocking).
          // If the queue is full, the data is simply dropped. This prevents this
          // high-priority control task from ever blocking on a full serial buffer.
          xQueueSend(s_pedalStateQueue, &newStatePackage, (TickType_t)0);
        }
      }

      profiler_pedalUpdateTask.end(7);
      profiler_pedalUpdateTask.end(0);
    }
  }
}

  






/**********************************************************************************************/
/*                                                                                            */
/*                         joystick output task                                               */
/*                                                                                            */
/**********************************************************************************************/

#ifdef USB_JOYSTICK
void IRAM_ATTR_FLAG joystickOutputTask( void * pvParameters )
{ 

  // FunctionProfiler profiler_joystickOutputTask;
  // profiler_joystickOutputTask.setName("JoystickOutput");
  // profiler_joystickOutputTask.setNumberOfCalls(500);
  // configDataPackage_t configPackage_st;
  // static DapConfig_t jut_dap_config_st;
  

  // This task now waits for a complete package of data from the queue.
  joystickDataPackage_t receivedJoystickData;

  
  for (;;)
  {

    // if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {
    if (xQueueReceive(s_joystickDataQueue, &receivedJoystickData, portMAX_DELAY) == pdPASS)
    {


      // start profiler 0, overall function
      // profiler_joystickOutputTask.start(0);
      // // if new data package is available, update the local config
      // if (xQueueReceive(configUpdateSendToJoystickTaskQueue, &configPackage_st, (TickType_t)0) == pdPASS) {
      //   jut_dap_config_st = configPackage_st.config_st;
      //   // activate profiler depending on pedal config
      //   if (jut_dap_config_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_CYCLE_TIMER) 
      //   {
      //     profiler_joystickOutputTask.activate( true );
      //   }
      //   else
      //   {
      //     profiler_joystickOutputTask.activate( false );
      //   }

      //   ActiveSerial->println("Update config: joystick task");
      // } 


      
      // profiler_joystickOutputTask.start(1);

      uint16_t joystickData_u16 = receivedJoystickData.joystickNormalizedToUInt16;
      bool sendFlag_b = receivedJoystickData.sendJoystickFlag_b;

      if (sendFlag_b)
      {
        // send joystick output
        if (IsControllerReady()) 
        {
          if(dap_calculationVariables_st.rudderStatus_b==false)
          {
            //general output
            // ActiveSerial->printf("joystick: %lu\n", joystickData_u16);
            SetControllerOutputValue(joystickData_u16);
          }
        }
      }

      // profiler_joystickOutputTask.end(1);
      // profiler_joystickOutputTask.end(0);

      // // print profiler results
      // profiler_joystickOutputTask.report();

    }
  }
}
#endif
/**********************************************************************************************/
/*                                                                                            */
/*                         communication task                                                 */
/*                                                                                            */
/**********************************************************************************************/

typedef struct {
    uint16_t startBytePos_u16;
    uint16_t endBytePos_u16;
    uint16_t payloadType_u16;
    bool validFlag_b;
} structChecker_st;

// Helper function to determine expected packet size from payload type
// Returns 0 if the payload type is unknown.
static inline size_t getExpectedPacketSize(uint8_t payloadType) {
    switch (payloadType) {
        case DAP_PAYLOAD_TYPE_CONFIG_U8:
            return sizeof(DapConfig_t);
        case DAP_PAYLOAD_TYPE_ACTION_U8:
            return sizeof(DapActions_t);
        case DAP_PAYLOAD_TYPE_ACTION_OTA_U8:
            return sizeof(DapActionOta_t);
        // Add other packet types here in the future
        default:
            return 0;
    }
}

// NOTE: The IRAM_ATTR attribute has been removed as it is not needed for a FreeRTOS task function.
void IRAM_ATTR_FLAG serialCommunicationTaskRx(void *pvParameters) {
    FunctionProfiler profiler_serialCommunicationTask;
    profiler_serialCommunicationTask.setName("SerialCommunicationRx");
    profiler_serialCommunicationTask.setNumberOfCalls(500);

    static DapConfig_t sct_dap_config_st;

    // Buffer to accumulate incoming serial data
    const size_t RX_BUFFER_SIZE = 1028; // Should be at least 2x the largest possible packet
    static uint8_t rx_buffer[RX_BUFFER_SIZE];
    static size_t buffer_len = 0;

