ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
                            }
                          #endif
                          
                          

                          
                      }
                      break;
                  }
                  case DAP_PAYLOAD_TYPE_ACTION_OTA_U8:{
                    memcpy(&dap_action_ota_st, packet_start, sizeof(DapActionOta_t));
                    ActiveSerial->println("Get OTA command");
                    buzzerBeepAction_b=true;

                    //ActiveSerial->readBytes((char*)&dap_action_ota_st, sizeof(DapActionOta_t));
                    #ifdef OTA_update
                      if(dap_action_ota_st.payloadHeader_st.payloadType_u8==DAP_PAYLOAD_TYPE_ACTION_OTA_U8)
                      {
                        if(dap_action_ota_st.payloadOtaInfo_st.deviceId_u8 == sct_dap_config_st.payloadPedalConfig_st.pedalType_u8)
                        {
                          g_SSID=new char[dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8+1];
                          g_PASS=new char[dap_action_ota_st.payloadOtaInfo_st.passLength_u8+1];
                          memcpy(g_SSID,dap_action_ota_st.payloadOtaInfo_st.wifiSsid_au8,dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8);
                          memcpy(g_PASS,dap_action_ota_st.payloadOtaInfo_st.wifiPass_au8,dap_action_ota_st.payloadOtaInfo_st.passLength_u8);
                          g_SSID[dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8]=0;
                          g_PASS[dap_action_ota_st.payloadOtaInfo_st.passLength_u8]=0;
                          g_OTA_enable_b=true;
                          g_OTA_enable_start=true;
                          #ifdef ESPNOW_Enable
                            g_ESPNow_OTA_enable=false;
                          #endif
                        }
                      }
                    #else
                      ActiveSerial->println("The command is not supported");
                    #endif    
                    break;
                }

                  
              } // end switch

                if (!structIsValid)
                {
                  ActiveSerial->printf("Invalid packet detected (Type: %d). Skipping SOF.\n", payloadType);
                  buffer_idx++; // Skip the failed SOF and continue scanning
                }
                else
                {
                  // Packet was valid and processed, advance index past this packet
                  buffer_idx += expectedSize;
              }
          } // end while

          // --- 3. Clean up the buffer ---
              if (buffer_idx > 0)
              {
              size_t remaining_len = buffer_len - buffer_idx;
                if (remaining_len > 0)
                {
                  memmove(rx_buffer, &rx_buffer[buffer_idx], remaining_len);
              }
              buffer_len = remaining_len;
          }

          profiler_serialCommunicationTask.end(0);
          profiler_serialCommunicationTask.report();
        } // end if TaskNotifyTake
    } // end for(;;)
}



uint32_t communicationTask_stackSizeIdx_u32 = 0;
void IRAM_ATTR_FLAG serialCommunicationTaskTx( void * pvParameters )
{ 
  // FunctionProfiler profiler_serialCommunicationTask;
  // profiler_serialCommunicationTask.setName("SerialCommunicationTx");
  // profiler_serialCommunicationTask.setNumberOfCalls(500);

  // static DapConfig_t sct_dap_config_st;

  // This task now waits for a complete package of data from the queue.
  PedalStatePackage_t receivedState;

  for (;;)
  {

    // global_dap_config_class.getConfig(&sct_dap_config_st, 0);

    // Block indefinitely until a new state package arrives from pedalUpdateTask.
    // This is now the ONLY trigger for this task.
    if (xQueueReceive(s_pedalStateQueue, &receivedState, portMAX_DELAY) == pdPASS)
    {
      
      // Now, process the first item, and then enter a loop to
      // empty the rest of the queue.
      do {
                
        // Copy to a local variable to calculate CRC
        DapStateBasic_t basic_to_send = receivedState.basic_st;
        DapStateExtended_t extended_to_send = receivedState.extended_st;



  // Provide pedal states to ESPnow task
  #ifdef ESPNOW_Enable
        // update pedal states
        if (s_semaphore_updatePedalStates != NULL)
        {
          if (xSemaphoreTake(s_semaphore_updatePedalStates, (TickType_t)0) == pdTRUE)
          {
            // move local structure values to global structures
            dap_state_basic_st = basic_to_send;
            dap_state_extended_st = extended_to_send;

            // release semaphore
            xSemaphoreGive(s_semaphore_updatePedalStates);
          }
        }
        else
        {
          s_semaphore_updatePedalStates = xSemaphoreCreateMutex();
        }
  #endif



        // activate profiler depending on pedal config
        // if (sct_dap_config_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_CYCLE_TIMER) 
        // {
        //   profiler_serialCommunicationTask.activate( true );
        // }
        // else
        // {
        //   profiler_serialCommunicationTask.activate( false );
        // }
        // // start profiler 0, overall function
        // profiler_serialCommunicationTask.start(0);

        // send basic pedal state struct
        if (receivedState.sendBasicFlag_b)
        {
          // update CRC before transmission
          basic_to_send.payloadFooter_st.checkSum_u16 = checksumCalculator_u16((uint8_t*)(&(basic_to_send.payloadHeader_st)), sizeof(basic_to_send.payloadHeader_st) + sizeof(basic_to_send.payloadPedalStateBasic_st));
          ActiveSerial->write((char*)&basic_to_send, sizeof(DapStateBasic_t));
        }

        // send extended pedal state struct
        if (receivedState.sendExtendedFlag_b)
        {
          // update CRC before transmission
          extended_to_send.payloadFooter_st.checkSum_u16 = checksumCalculator_u16((uint8_t*)(&(extended_to_send.payloadHeader_st)), sizeof(extended_to_send.payloadHeader_st) + sizeof(extended_to_send.payloadPedalStateExtended_st));
          ActiveSerial->write((char*)&extended_to_send, sizeof(DapStateExtended_t));
        }

